#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include "general.h"
#include "deck.h"

/* Πρέπει να εχουμε και μια μεταβλητη που να δειχνει μονο το hidden χαρτι του dealer ωστε το bot 
να συμπεριφερεται αναλόγως (π.χ. άμα ο dealer έχει μικρό χαρτι (3 of Spades) δεν κάνουμε hit)*/

/* Οφείλουμε να κάνουμε αρκετές αλλαγές στο base κομμάτι του κώδικα για να τρέχει πανω στο user interface αλλα μία
άλλη επιλογή είναι να φτιάξουμε interface μόνο και μόνο για τα bots*/

// Το stage του play για το bot (θα καλείτε ανάλογα με το μέγεθος του bot_count)
void bot_play(){

}





// Σίγουρα στο 15,16 θα του βάζουμε 50/50 random (δηλαδή 0 η 1) για το αν θα κάνει hit
void bot_hit_stand(){

}


// Να το κάνουμε είτε να το κάνει όταν έχει 17 και πάνω από την αρχή (μία άλλη ιδέα είναι να του βάλουμε random)
void bot_double(){



}



// Νά το επιλέγει κάθε φορά που έχει διπλά χαρτιά (και βέβαια έχει αρκετό balance !!)
void bot_split(){

}



// Θα μπετάρει με random πάλι αλλά άμα του το επιτρέπει το balance του, θα ποντάρει σε range κοντινό με τον παίκτη μας
void bot_bet(){

}

